read_verilog -sv ./*.sv
read_verilog -sv ./core/*.sv
synth -top soc
opt
memory_bram
opt
techmap
stat